# Performance: SQL vs. DataFrame

## 1. Time

Get time since Jan 1, 1970:

```python
import time
time.time()
```

Try it, and convert to years.

## 2. Generate Synthetic DataFrame

With `N` rows and 3 columns.  Each column contains the same (ascending integers).

## 3. DataFrame to SQL Table

Use `df.to_sql("????", conn, if_exists="replace", index=False)`

## 4. LIMIT vs. head

## 5. Creating an Index

```sql
CREATE INDEX test_idx ON ????(????)
```

In [8]:
conn.execute("CREATE INDEX test_idx ON tbl(col2)")

In [9]:
t0 = time.time()
results = pd.read_sql("select * from tbl where col1 < 10", conn)
t1 = time.time()
print((t1 - t0) * 1000)
results

49.38697814941406

   col1  col2  col3
0     0     0     0
1     1     1     1
2     2     2     2
3     3     3     3
4     4     4     4
5     5     5     5
6     6     6     6
7     7     7     7
8     8     8     8
9     9     9     9

In [10]:
t0 = time.time()
results = pd.read_sql("select * from tbl where col2 < 10", conn)
t1 = time.time()
print((t1 - t0) * 1000)
results

2.026081085205078

   col1  col2  col3
0     0     0     0
1     1     1     1
2     2     2     2
3     3     3     3
4     4     4     4
5     5     5     5
6     6     6     6
7     7     7     7
8     8     8     8
9     9     9     9

In [11]:
t0 = time.time()
results = pd.read_sql("select * from tbl where col3 < 10", conn)
t1 = time.time()
(t1 - t0) * 1000

55.09614944458008